print('Напиши тип задачи:сли на информацию - напиши 1,на звук - 2,на изображения - 3')
a = int(input())
if a == 1:
    
    while a != 5:
        print('Введи значения, которые у тебя есть:I = 1,k = 2,3 = i, N = 4, 5-ввод закончен,6 - перейти к решению задачи')

        a = int(input(print('Введи свою переменную')))
        if a == 1:
            print('Введи I')
            I = input()
            print('если нужно следующую перменную то пиши 5!!')
        elif a == 2:
            k = input('Введи k ')
            print(k)
            print('если нужно следующую перменную то пиши 5!!')
        elif a == 3:
            i = input('Введи i')
            print(k)
            print('если нужно следующую перменную то пиши 5!!')
        elif a == 4:
            N = input('Введи N')
            print(k)
            print('если нужно следующую перменную то пиши 5!!')
        elif a == 5:
            x = input(print('введи номер следующей перменной'))
        elif a == 6:
            break


        
    
    

    
